Show / Hide Table of Contents
Class DesignMemberInSubStructure
DesignMemberInSubStructure
Inheritance
System.Object
OpenObject
DesignMemberInSubStructure
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.DesignMemberInSubStructure, CI.StructuralElements", "CI.StructModel.Structure.IDesignMemberInSubStructure,CI.BasicTypes")]
public class DesignMemberInSubStructure : OpenObject
Properties
Improve this Doc   View Source
DesignMember
Reference to DesignMember
Declaration
public ReferenceElement DesignMember { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source